Autodesk.Navisworks.Api.Plugins.FileProtocolHandle
A file handle opened via the FileProtocolPlugin.

Autodesk.Navisworks.Api.Plugins.FileProtocolHandle.#ctor
Default constructor.

Autodesk.Navisworks.Api.Plugins.FileProtocolHandle.Close
Closes an open file handle.

Autodesk.Navisworks.Api.Plugins.FileProtocolHandle.Read(System.Byte[],System.UInt64,System.UInt64)
Reads data from a file.

Autodesk.Navisworks.Api.Plugins.FileProtocolHandle.Write(System.Byte[],System.UInt64,System.UInt64)
Writes data to a file.